Revit 2027 API
ElementNode.Document Property
 Gets the document associated with the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Document Document { get; }
Public ReadOnly Property Document As Document
	Get
public:
property Document^ Document {
	Document^ get ();
}
member Document : Document with get
Property Value
Document
Remarks
 The document is in read-only state. Transactions are not allowed in it.
See Also
Reference
ElementNode Class
Autodesk.Revit.DB Namespace